In [15]:
import pandas as pd

#Leitura dos arquivos
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [16]:

#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [3]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [4]:

#Exibindo as 5 Ãºltimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [6]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
16   Fortaleza 2019-01-01   97.32    1002     5
204      Natal 2019-01-02  151.41    1037     2
55       Natal 2019-01-08  859.00     854     4
183      Natal 2019-01-02  120.23    1037     2
102      Natal 2019-01-02   40.84    1034     3

In [7]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [9]:

#Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [10]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

In [17]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [18]:
#Substituindo os valores nulos pela mÃ©dia
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [19]:
df["Vendas"].mean()

122.61180089485438

In [20]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [21]:
df.sample(15)

        Cidade       Data  Vendas  LojaID  Qtde
74       Natal 2019-03-10  303.00     854     3
87      Recife 2019-01-01  210.06     983     4
2    Fortaleza 2019-02-10   35.33    1004     3
66       Natal 2019-03-24  559.00     853     2
63   Fortaleza 2019-01-01  118.17    1004     1
117   Salvador 2019-03-02   39.41    1034     1
38   Fortaleza 2019-01-01   35.09    1004     4
19     Aracaju 2018-01-01   43.96    1520     9
116     Recife 2019-03-02   79.10     982     2
58   Fortaleza 2019-01-01   38.90    1004     4
186   Salvador 2019-01-02  169.09    1036     2
3     Salvador 2019-02-10  176.34    1037     3
103      Natal 2019-01-02  191.60    1034     1
26    Salvador 2019-01-01  183.45    1036     3
27       Natal 2018-07-16  390.00     853     3

In [22]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [23]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [24]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [25]:

#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

In [26]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])
df.head()

    Cidade       Data  Vendas  LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00    1520     1   142.00
1  Aracaju 2018-01-01   14.21    1522     6    85.26
2  Aracaju 2018-01-01   71.55    1520     1    71.55
3  Aracaju 2018-01-01    3.01    1521     7    21.07
4  Aracaju 2018-01-01   24.51    1522     8   196.08

In [27]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]
df.head()

    Cidade       Data  Vendas  LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00    1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21    1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55    1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01    1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51    1522     8   196.08             8.0

In [28]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [29]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [30]:
#nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas  LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0     853     4   3544.0             4.0
51  Natal 2018-01-21   859.0     852     4   3436.0             4.0
55  Natal 2019-01-08   859.0     854     4   3436.0             4.0

In [31]:

#nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas  LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34    1522     1     3.34             1.0
65    Recife 2019-01-01    4.01     981     1     4.01             1.0
92     Natal 2019-01-02    4.57    1035     1     4.57             1.0

In [32]:

#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [33]:

#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas  LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0     853     4   3544.0             4.0
55  Natal 2019-01-08   859.0     854     4   3436.0             4.0
51  Natal 2018-01-21   859.0     852     4   3436.0             4.0
30  Natal 2018-10-02   856.0     853     4   3424.0             4.0
41  Natal 2018-05-20   835.0     852     4   3340.0             4.0
38  Natal 2018-02-25   828.0     852     4   3312.0             4.0
10  Natal 2018-10-27   828.0     852     4   3312.0             4.0
69  Natal 2019-03-24   817.0     852     4   3268.0             4.0
62  Natal 2018-02-10   793.0     854     4   3172.0             4.0
52  Natal 2018-04-27   778.0     854     4   3112.0             4.0

In [34]:

#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [35]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID              int64
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [36]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [37]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                     int64
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [38]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [39]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [40]:
df.sample(5)

      Cidade       Data  Vendas  ...  Receita  Receita/Vendas  Ano_Venda
95    Recife 2019-01-01   40.03  ...   120.09             3.0       2019
81     Natal 2019-04-02  564.00  ...  1128.00             2.0       2019
24     Natal 2018-04-22  868.00  ...  2604.00             3.0       2018
71    Recife 2019-01-01  138.69  ...   416.07             3.0       2019
44  Salvador 2019-01-01   43.26  ...    86.52             2.0       2019

[5 rows x 8 columns]

In [41]:
#Extraindo o mÃªs e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [42]:
df.sample(5)

        Cidade       Data  Vendas  ...  Ano_Venda  mes_venda  dia_venda
91   Fortaleza 2019-01-01   37.49  ...       2019          1          1
118  Fortaleza 2019-03-02   17.70  ...       2019          3          2
50   Fortaleza 2019-01-01   33.69  ...       2019          1          1
16   Fortaleza 2019-01-01   97.32  ...       2019          1          1
75    Salvador 2019-01-01  155.52  ...       2019          1          1

[5 rows x 10 columns]

In [43]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [44]:
#Calculando a diferenÃ§a de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [45]:
df.sample(5)

        Cidade       Data  Vendas  ...  mes_venda  dia_venda  diferenca_dias
19   Fortaleza 2019-01-01   18.86  ...          1          1        365 days
116  Fortaleza 2019-03-02   79.10  ...          3          2        425 days
128   Salvador 2019-03-02   36.84  ...          3          2        425 days
72     Aracaju 2018-01-01  168.95  ...          1          1          0 days
154   Salvador 2019-01-02    9.58  ...          1          2        366 days

[5 rows x 11 columns]

In [46]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [47]:
df.sample(5)

       Cidade       Data  Vendas  ...  dia_venda  diferenca_dias  trimestre_venda
175  Salvador 2019-01-02   16.53  ...          2        366 days                1
15   Salvador 2019-01-01   20.15  ...          1        365 days                1
207     Natal 2019-01-02   46.70  ...          2        366 days                1
49   Salvador 2019-01-01   37.88  ...          1        365 days                1
99     Recife 2019-01-01  136.72  ...          1        365 days                1

[5 rows x 12 columns]

In [48]:
#Filtrando as vendas de 2019 do mÃªs de marÃ§o
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [49]:
vendas_marco_19.sample(20)

        Cidade       Data  Vendas  ...  dia_venda  diferenca_dias  trimestre_venda
130     Recife 2019-03-02   12.36  ...          2        425 days                1
82       Natal 2019-03-07  868.00  ...          7        430 days                1
119  Fortaleza 2019-03-02  152.30  ...          2        425 days                1
129   Salvador 2019-03-02  125.66  ...          2        425 days                1
125  Fortaleza 2019-03-02   37.60  ...          2        425 days                1
135  Fortaleza 2019-03-02   10.79  ...          2        425 days                1
109     Recife 2019-03-02   18.90  ...          2        425 days                1
115   Salvador 2019-03-02  202.33  ...          2        425 days                1
112  Fortaleza 2019-03-02  133.59  ...          2        425 days                1
119     Recife 2019-03-02  152.30  ...          2        425 days                1
131  Fortaleza 2019-03-02  139.07  ...          2        425 days                1
135   Salvador 2019-03-02    9.95  ...          2        425 days                1
110   Salvador 2019-03-02  185.93  ...          2        425 days                1
109   Salvador 2019-03-02  124.37  ...          2        425 days                1
2        Natal 2019-03-11  308.00  ...         11        434 days                1
5        Natal 2019-03-30  674.00  ...         30        453 days                1
140  Fortaleza 2019-03-02  166.89  ...          2        425 days                1
137  Fortaleza 2019-03-02   51.99  ...          2        425 days                1
123     Recife 2019-03-02   20.22  ...          2        425 days                1
134   Salvador 2019-03-02  125.90  ...          2        425 days                1

[20 rows x 12 columns]